glcloud/keil_v5/ARM/PACK/.Web/NXP.MKV10Z1287_DFP.pdsc
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MKV10Z1287" Cversion="1.0.0" condition="device.MKV10Z1287_AND_component.serial_manager_uart_AND_component.uart_adapter_AND_device.MKV10Z1287_startup_AND_driver.clock_AND_driver.common_AND_driver.gpio_AND_driver.port_AND_driver.smc_AND_driver.uart_AND_utility.debug_console" isDefaultVariant="1">
      <description/>
      <files>
        <file category="header" attr="config" name="project_template/board.h"/>
        <file category="sourceC" attr="config" name="project_template/board.c"/>
        <file category="header" attr="config" name="project_template/clock_config.h"/>
        <file category="sourceC" attr="config" name="project_template/clock_config.c"/>
        <file category="header" attr="config" name="project_template/pin_mux.h"/>
        <file category="sourceC" attr="config" name="project_template/pin_mux.c"/>
        <file category="header" attr="config" name="project_template/peripherals.h"/>
        <file category="sourceC" attr="config" name="project_template/peripherals.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="MKV10Z1287_startup" Cversion="1.0.0" condition="device.MKV10Z1287_AND_CMSIS_Include_core_cm0plus">
      <description/>
      <files>
        <file condition="iar" category="sourceAsm" attr="config" name="iar/startup_MKV10Z1287.s"/>
        <file condition="mdk" category="sourceAsm" attr="config" name="arm/startup_MKV10Z1287.s"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKV10Z128xxx7_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKV10Z128xxx7_ram.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKV10Z64xxx7_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKV10Z64xxx7_ram.scf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKV10Z128xxx7_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKV10Z128xxx7_ram.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKV10Z64xxx7_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKV10Z64xxx7_ram.icf"/>
        <file category="header" attr="config" name="fsl_device_registers.h"/>
        <file category="header" attr="config" name="MKV10Z1287.h"/>
        <file category="header" attr="config" name="MKV10Z1287_features.h"/>
        <file category="sourceC" attr="config" name="system_MKV10Z1287.c"/>
        <file category="header" attr="config" name="system_MKV10Z1287.h"/>
      </files>
    </component>
  </components>
</package>
